//
//  Zodiac.swift
//  SwiftProjectM2_004
//
//  Created by Irinka Datoshvili on 10.04.24.
//

import Foundation

struct Zodiac {
    var sign: String
    var description: String
    var polarSign: String
    var imageName: String
    
    static let allZodiacs: [Zodiac] = [
        Zodiac(sign: "ვერძი", description: "დაბადებულია მოგებისთვის, ძალიან აქტიური და კომუნიკაბელურია. არის თავმოყვარე, თავდაჯერებული, უშიშარი. მას მართავს გრძნობები, ჯერ აკეთებს და მერე ფიქრობს. იმპულსურია. გრძნობები უბინდავენ გონებას. ვნებიანი და ეგოისტია. ვერ იტანს, როცა რამეს უკრძალავენ. მათში ყველაფერი დიდი დოზითაა. ასევე ავანტიურისტია.", polarSign: "სასწორი", imageName: "Aries"),
        Zodiac(sign: "კურო", description: "პრაქტიკული, რეალისტი, პრაგმატული, პესიმისტი, უყვართ და პატივს სცემენ სიმდიდრეს, მაგრამ ხემოჭერილები არიან, უფრთხილდებიან იმას, რაც აქვთ. იზიდავთ გართობა და სიამოვნება. უყვართ სახლი და ოჯახი. მესაკუთრეები და კარგი მშობლები არიან. ჯიუტები, ძლიერი სულის პატრონები და შრომისმოყვარეები არიან. არ აქვთ არასრულყოფილების კომპლექსი. სულის სიღრმეში თავი სამყაროს ღერძებად მიაჩნიათ.", polarSign: "მორიელი", imageName: "Taurus"),
        Zodiac(sign: "ტყუპები", description: "ძალიან უყვართ ჭორების და ინფორმაციების შეგროვება. იციან ყველაფერი ყველაფერზე და მათ შეიძლება შეხვდეთ ყველგან. გონებამახვილი, ცოცხალი, კომუნიკაბელური, მჭერმეტყველი.. ეს ყველაფერი ტყუპებზეა ნათქვამი. მათთან არ მოიწყენ. მიისწრაფიან სრულყოფილებისკენ, რათა ყველას თავი მოაწონონ. ადვილად ეგუებიან ყველაფერს. აქვთ უამრავი იდეა... სჭირთ გაორება.", polarSign: "მშვილდოსანი", imageName: "Gemini" ),
        Zodiac(sign: "კიბო", description: " რომანტიკული, გულიანი, უყვართ ბავშვები, ცხოველებიც. აქვთ მაღალი პასუხისმგებლობის გრძნობა. არიან დაკომპლექსებულები, ძალიან ეჭვიანები, თავგანწირულები, სენტიმენტალურები და კონსერვატორები. მესაკუთრეები, მგრძნობიარეები. აქვთ მდიდარი ფანტაზია და კარგი ინტუიცია.", polarSign: "თხის რქა", imageName: "Cancer"),
        Zodiac(sign: "ლეო", description: "მამაცი, შეუპოვარი და გულუხვი. ცნობისმოყვარე, გავლენიანი, ცეცხლოვანი, უყვარს მართვა, საკუთარ თავზე შეყვარებული, ეგოცენტრიკი, პრესტიჟი მათთვის ყველაფერია, მიმზიდველი, არტისტული, მაგნიტური, დაბადებულია ლიდერად, რომანტიკული, ქარიზმატული, უყვართ ყურადღების ცენტრში ყოფნა და ხშირად იმსახურებენ კიდეც.", polarSign: "მერწყული", imageName: "Leo"),
        Zodiac(sign: "ქალწული", description: "თავშეკავებული, პედანტური, ანალიტიკური გონება, კრიტიკოსი, ყურადღებას აქცევს წვრილმანებს, რაციონალური, გამოთვლილი და დაგეგმილი აქვს ყველაფერი. პრაქტიკოსი, მომთხოვნი, საღი გონების პატრონი.", polarSign: "თევზები", imageName: "Virgo"),
        Zodiac(sign: "სასწორი", description: "გაუბედავი, ჰარმონიული, პაცეფისტი, დამთმობი, გაურბის კონფლიქტეპს, დიპლომატი, არ უყვარს მარტოობა, ხშირად სისულელეებს აკეთებს, იდეალისტი, რომანტიკოსი, მიმზიდველი, უყვარს ხელოვნება, ახასიათებს მოუთმენლობა.", polarSign: "Aries", imageName: "სასწორი"),
        Zodiac(sign: "მორიელი", description: "მიდრეკილია დაპყრობისკენ, მისი დევიზია 'ყველაფერი ან არაფერი', ვნებიანია, მოსწონს მისტიკა, არღვევს ტაბუებს, თავდაჯერებული და მესაკუთრეა. ჯიუტი, რისკიანი, ემოციური, მიმწოლი ხასიათისაა.", polarSign: "კურო", imageName: "Scorpio"),
        Zodiac(sign: "მშვილდოსანი", description: "პირდაპირი, სამართლიანი, აგრესიული ოპტიმისტი, უყვარს ძებნა და პოვნა, არ აქვს ზომიერების შეგრძნება, სულ მოძრაობს, ფარული სურვილი აქვს ფლობის, იმპულსურია.", polarSign: "ტყუპები", imageName: "Sagittarius"),
        Zodiac(sign: "თხის რქა", description: "ახასიათებს თავმოყვარეობა, სიმდიდრის სიყვარული, პრაგმატულობა, სიფრთხილე, ამბიციურობა, თავშეკავებულობა, დამოუკიდებლობა . მათთვის ძალიან მნიშვნელოვანია მატერიალური კეთილდღეობა და სტატუსი. არიან კარიერისტები და კონსერვატორები.", polarSign: "კიბო", imageName: "Capricorn"),
        Zodiac(sign: "მერწყული", description: "ორიგინალური, ალტრუისტი, იდეალისტი, იდეალური მებრძოლი, კომუნიკაბელური, თავისუფლების მოყვარული, ექსტრავაგანტული, უყვარს პუბლიკის შოკურ მდგომარეობამდე მიყვანა. არიან ინტელექტუალები, ვერ იტანენ რუტინულ ცხოვრებას", polarSign: "ლეო", imageName: "Aquarius"),
        Zodiac(sign: "თევზები", description: "გრძნობიარე მეოცნებეები, მდიდარი ფანტაზია, მიმზიდველობა, შემოქმედებითი ხასიათი, არტისტიზმი, პასიურები, გაუბედავები, ფატალურები, რეფლექსურები, აქვთ კარგი ინტუიცია.", polarSign: "ქალწული", imageName: "Pisces")
       ]
}

extension Zodiac {
    static func zodiac(forName name: String) -> Zodiac? {
        return allZodiacs.first { $0.sign.lowercased() == name.lowercased() }
    }
}
